In [1]:
import pandas as pd

# Basic Indexing

In [2]:
##Basic Indexing

oil_data = {'France' : {'2015-Q1': 100.1,'2015-Q2': 104.6, '2015-Q3': 400, '2025-Q4': 340},
            'Germany' : {'2015-Q1': 110.1,'2015-Q2': 156.6, '2015-Q3': 250, '2025-Q4': 270},                                                                             
            'Poland' : {'2015-Q1': 99.0,'2015-Q2': 103.6, '2015-Q3': 105.7, '2025-Q4': 450},
           }
oil_data

{'France': {'2015-Q1': 100.1,
  '2015-Q2': 104.6,
  '2015-Q3': 400,
  '2025-Q4': 340},
 'Germany': {'2015-Q1': 110.1,
  '2015-Q2': 156.6,
  '2015-Q3': 250,
  '2025-Q4': 270},
 'Poland': {'2015-Q1': 99.0,
  '2015-Q2': 103.6,
  '2015-Q3': 105.7,
  '2025-Q4': 450}}

In [3]:
oil_df=pd.DataFrame.from_dict(oil_data)
oil_df

         France  Germany  Poland
2015-Q1   100.1    110.1    99.0
2015-Q2   104.6    156.6   103.6
2015-Q3   400.0    250.0   105.7
2025-Q4   340.0    270.0   450.0

In [4]:
France_data = oil_df['France']
France_data

2015-Q1    100.1
2015-Q2    104.6
2015-Q3    400.0
2025-Q4    340.0
Name: France, dtype: float64

In [5]:
#order of the coloumns in a different way

oil_df[['Poland','Germany','France']]

         Poland  Germany  France
2015-Q1    99.0    110.1   100.1
2015-Q2   103.6    156.6   104.6
2015-Q3   105.7    250.0   400.0
2025-Q4   450.0    270.0   340.0

In [6]:
oil_df['France'] #oil_df_France

2015-Q1    100.1
2015-Q2    104.6
2015-Q3    400.0
2025-Q4    340.0
Name: France, dtype: float64

In [7]:
oil_df[::-1]

         France  Germany  Poland
2025-Q4   340.0    270.0   450.0
2015-Q3   400.0    250.0   105.7
2015-Q2   104.6    156.6   103.6
2015-Q1   100.1    110.1    99.0

In [8]:
##label  -oriented indexing

snow_data = {'Months': ['January','February','March','April','May','June'],
            'Avg low temp': [26,34,25,45,23,21],
            'Avg precip' : [17.8,12.3,11.7,34.0,12.3,11.5],
             'Avg snowdays' : [3.0,6.0,5.0,2.0,3.3,4.5]}

In [9]:
snow_df = pd.DataFrame(snow_data, index = snow_data['Months'], columns = ['Avg low temp','Avg precip','Avg snowdays'])
snow_df

          Avg low temp  Avg precip  Avg snowdays
January             26        17.8           3.0
February            34        12.3           6.0
March               25        11.7           5.0
April               45        34.0           2.0
May                 23        12.3           3.3
June                21        11.5           4.5

In [10]:
snow_df.loc[['January']]

         Avg low temp  Avg precip  Avg snowdays
January            26        17.8           3.0

In [11]:
snow_df.loc[['January','June']]

         Avg low temp  Avg precip  Avg snowdays
January            26        17.8           3.0
June               21        11.5           4.5

In [12]:
#Basic indexing syntax
snow_df.loc[:,'Avg low temp']

January     26
February    34
March       25
April       45
May         23
June        21
Name: Avg low temp, dtype: int64

In [13]:
snow_df.loc['March','Avg low temp']

25

In [14]:
snow_df.loc['March']['Avg low temp'] #the row will be first then the column

25.0

In [15]:
snow_df['Avg low temp']['March'] #without .loc, the col will be first then the row

25

In [20]:
oil_df

         France  Germany  Poland
2015-Q1   100.1    110.1    99.0
2015-Q2   104.6    156.6   103.6
2015-Q3   400.0    250.0   105.7
2025-Q4   340.0    270.0   450.0

In [21]:
#Select all the rows where 2015-Q1>100. Get only those values

oil_df.where(oil_df[:1]>100)

         France  Germany  Poland
2015-Q1   100.1    110.1     NaN
2015-Q2     NaN      NaN     NaN
2015-Q3     NaN      NaN     NaN
2025-Q4     NaN      NaN     NaN

In [18]:
oil_df.loc[:, oil_df.loc['2015-Q1'] > 100 ]     #getting relevant values

         France  Germany
2015-Q1   100.1    110.1
2015-Q2   104.6    156.6
2015-Q3   400.0    250.0
2025-Q4   340.0    270.0

In [36]:
oil_df.loc['2015-Q1'][["France","Germany"]]

France     100.1
Germany    110.1
Name: 2015-Q1, dtype: float64

In [38]:
oil_df.describe().transpose() #to find out the statistical methods of oil_df dataframe

         count     mean         std    min      25%     50%      75%    max
France     4.0  236.175  156.467939  100.1  103.475  222.30  355.000  400.0
Germany    4.0  196.675   75.985410  110.1  144.975  203.30  255.000  270.0
Poland     4.0  189.575  173.639212   99.0  102.450  104.65  191.775  450.0

In [39]:
#Integer  -oriented indexing

z = {'x': [1,2,3,4,5], 'y':[11,12,13,14,15], 'z':[21,22,23,24,25]}
z

{'x': [1, 2, 3, 4, 5], 'y': [11, 12, 13, 14, 15], 'z': [21, 22, 23, 24, 25]}

In [40]:
x1=pd.DataFrame(z, index = list(range(0,10,2)))
x1

   x   y   z
0  1  11  21
2  2  12  22
4  3  13  23
6  4  14  24
8  5  15  25

In [41]:
x1.iloc[:4]

   x   y   z
0  1  11  21
2  2  12  22
4  3  13  23
6  4  14  24

In [42]:
x1.iloc[2,0:2]

x     3
y    13
Name: 4, dtype: int64

In [43]:
x1.loc[2]

x     2
y    12
z    22
Name: 2, dtype: int64

In [45]:
x1.loc[[4]]  #x1.loc[4]

   x   y   z
4  3  13  23

In [44]:
x1.iat[3,0]

4

In [46]:
%timeit x1.iloc[3,0]

11.1 µs ± 137 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [47]:
%timeit x1.iat[3,0]

6.89 µs ± 374 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [48]:
#Boolean Indexing

stock_prices=pd.read_csv("D:/Manipal Data Science/First Term/NumPy/stock_index_prices.csv")
stock_prices

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [49]:
stock_prices.loc[(stock_prices.Nasdaq>4300) & (stock_prices.PriceType == "close")]

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [50]:
#select rows where PriceType = "High" & "Nasdaq" < 4300
#isin & any,all
#where
#mask

In [51]:
stock_prices.loc[(stock_prices.Nasdaq<4300) & (stock_prices.PriceType == "high")]

  TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
2  2014/02/21      high  4284.85  1846.13       1168.43